<?php
session_start();
//اتصال دیتا بیس


//ورود به سایت
$user_name=isset($_REQUEST['user_name'])? $_REQUEST['user_name']:"";
$_SESSION['user_name']=isset($user_name)? $user_name:"";

	
$_SESSION['type']=isset($_REQUEST['type'])? $_REQUEST['type']:"";
$type=isset($_SESSION['type'])? $_SESSION['type']:"";

$_SESSION['user_password']=isset($_REQUEST['user_password'])? $_REQUEST['user_password']:"";
$user_password=isset($_SESSION['user_password'])? $_SESSION['user_password']:"";
//وارد شدن به صفحات مختلف
//تنظیمات خروج 
if(isset($_REQUEST['logout'])){
	unset($_SESSION['login']);
	unset($_SESSION['extra']);
	unset($_SESSION['panel']);
};

if(isset($_REQUEST['logout2'])){
	unset($_SESSION['login2']);
		unset($_SESSION['extra']);
	unset($_SESSION['panel']);
};
//تنظیمات ورود
$islogin=false;
if($type!='no_select'){
if(isset($_REQUEST['login'])){
	
	
	$sql="SELECT * FROM `$type` WHERE `code_meli`='$user_name' and `password`='$user_password';";
	$result= mysqli_query($conn,$sql);
	$found= mysqli_num_rows($result);
	if($found){
    $row = mysqli_fetch_assoc($result);
	$role=isset($row['role'])? $row['role']:"";
	$_SESSION['role']=$role;
	$_SESSION['login']=true;
    $_SESSION['klass1'] = isset($row['klas1'])? $row['klas1']:"";
    $_SESSION['klass2'] = isset($row['klas2'])? $row['klas2']:"";
    $_SESSION['klass3'] = isset($row['klas3'])? $row['klas3']:"";
    $_SESSION['klass4'] = isset($row['klas4'])? $row['klas4']:"";
    $_SESSION['klass5'] = isset($row['klas5'])? $row['klas5']:"";
    $_SESSION['klass6'] = isset($row['klas6'])? $row['klas6']:"";
	$_SESSION['dars1'] = isset($row['dars1'])? $row['dars1']:"";
    $_SESSION['dars2'] = isset($row['dars2'])? $row['dars2']:"";
    $_SESSION['dars3'] = isset($row['dars3'])? $row['dars3']:"";
    $_SESSION['dars4'] = isset($row['dars4'])? $row['dars4']:"";
    $_SESSION['dars5'] = isset($row['dars5'])? $row['dars5']:"";
    $_SESSION['dars6'] = isset($row['dars6'])? $row['dars6']:"";
    $_SESSION['code_meli'] = isset($row['code_meli'])? $row['code_meli']:"";
	$type2=isset($row['type'])? $row['type']:"";
	$_SESSION['type2']=$type2;
	$id=isset($row['id'])? $row['id']:"";
	$_SESSION['id']=$id;
	$name=isset($row['name'])? $row['name']:"";
	$_SESSION['name']=$name;
	$family=isset($row['family'])? $row['family']:"";
	$_SESSION['family']=$family;
	
	}else{
		echo '<div class="alert alert-danger px-5">نام کاربری یا رمز عبور نادرست است</div>';
	};

};
}else{
	echo 'لطفا نقش خود را انتخاب کنید';
}
if(isset($_SESSION['login']) && $_SESSION['login']==true){
	$islogin=true;
	
}else{
	$islogin=false;
};
	
	
	
	


//
$panel="";

if(isset($_REQUEST['extra'])){
	$_SESSION['extra']=$_REQUEST['extra'];
};

if(!isset($_SESSION['extra'])){
	$_SESSION['extra']='post';
};

if(isset($_SESSION['extra'])){
	$extra=$_SESSION['extra'];
};

if(isset($_REQUEST['panel'])){
	$_SESSION['panel']=$_REQUEST['panel'];
};

if(!isset($_SESSION['panel'])){
	$_SESSION['panel']='newPost';
};

if(isset($_SESSION['panel'])){
	$panel=$_SESSION['panel'];
};

if(isset($_REQUEST['class_name5'])){
	$_SESSION['class_name5']=$_REQUEST['class_name5'];
};

if(!isset($_SESSION['class_name5'])){
	$_SESSION['class_name5']='یازدهم_ریاضی_الف';
};

if(isset($_SESSION['class_name5'])){
	$class_name5=$_SESSION['class_name5'];
};

$pageName2="";
switch($panel){
	case "mychild":
	$pageName2="فرزندان من";
	break;
	case "editPost":
	$pageName2="ویرایش یک خبر";
	break;
	case "deletPost":
	$pageName2="حذف یک خبر";
	break;
	case "myNews":
	$pageName2="خبر های من";
	break;
	case "lossNews":
	$pageName2="خبر های تایید نشده من";
	break;
	case "userName":
	$pageName2="نام کاربری من";
	break;
	case "userPass":
	$pageName2="رمز عبور من";
	break;
	case "number":
	$pageName2="شماره موبایل من";
	break;
	case "addReporter":
	$pageName2="اضافه کردن خبرنگار جدید";
	break;
	case "editReporter":
	$pageName2="اعطا نام و رمز به خبرنگاران";
	break;
	case "deletReporter":
	$pageName2="حذف خبرنگار";
	break;
		//صفحه معلم
	case "dalyList":
	$pageName2="لیست روزانه";
	break;
    case "student_list":
	$pageName2="لیست دانش آموزان";
	break;
	case "teacher_list":
	$pageName2="لیست معلمان";
	break;
	case "class_list":	
	$pageName2="لیست کلاس ها";
	break;
	case "start_site":	
	$pageName2="تنظیمات صفحه اول سایت";
	break;
	case "moaven_list":
	$pageName2="لیست کادر مدرسه";
	break;
};


//ثبت نام افراد در دوره ها
$ful_name=isset($_REQUEST['ful_name'])? $_REQUEST['ful_name']:"";
$dore_name=isset($_REQUEST['dore_name'])? $_REQUEST['dore_name']:"";
$number_dore=isset($_REQUEST['number_dore'])? $_REQUEST['number_dore']:"";
if(isset($_REQUEST['submit_dore'])){
	$sql= "INSERT INTO `school_register_dore`(`ful_name`, `number`, `dore_name`) VALUES ('$ful_name','$number_dore','$dore_name');";
	 mysqli_query($conn,$sql);
	$erorrr="شبت نام با موفقیت انجام شد";

		
};





$sql000="INSERT INTO `school_managers` (`name`, `family`, `code_meli`, `password`, `madrak`, `birth`, `role`, `role2`, `type`) VALUES ('رضا علی', 'کمالی', '423', 'sampad', NULL, NULL, 'کادر مدرسه', 'مدیر مدرسه', 'اختیار تام');";

$sql00="
INSERT INTO `school_dars` (`id`, `grade`, `reshte`, `dars`) VALUES
(19, 'دهم_', 'ریاضی', 'شیمی(1)-دهم ریاضی'),
(18, 'دهم_', 'ریاضی', 'فیزیک(1)-دهم ریاضی'),
(17, 'دهم_', 'ریاضی', 'عربی، زبان قرآن(1)-دهم ریاضی'),
(16, 'دهم_', 'ریاضی', 'دین و زندگی(1)-دهم ریاضی'),
(14, 'دهم_', 'ریاضی', 'فارسی(1)-دهم ریاضی'),
(15, 'دهم_', 'ریاضی', 'نگارش(1)-دهم ریاضی'),
(20, 'دهم_', 'ریاضی', 'ریاضی(1)-دهم ریاضی'),
(21, 'دهم_', 'ریاضی', 'هندسه(1)-دهم ریاضی'),
(22, 'دهم_', 'ریاضی', 'آمادگی دفاعی-دهم ریاضی'),
(23, 'دهم_', 'ریاضی', 'آزمایشگاه علوم تجربی(1)-دهم ریاضی'),
(24, 'دهم_', 'ریاضی', 'جغرافیای ایران-دهم ریاضی'),
(25, 'دهم_', 'ریاضی', 'هنر-دهم ریاضی'),
(26, 'دهم_', 'ریاضی', 'کارگاه کار آفرینی و تولید-دهم ریاضی'),
(27, 'دهم_', 'ریاضی', 'تفکر و سواد رسانه ای-دهم ریاضی'),
(28, 'دهم_', 'ریاضی', 'تعلیمات ادیان الهی و اخلاق (1) ـ ویژه اقلیت های دینی-دهم ریاضی'),
(29, 'دهم_', 'ریاضی', 'انگلیسی(1)-دهم ریاضی'),
(30, 'دهم_', 'ریاضی', 'کتاب کار انگلیسی(1)-دهم ریاضی'),
(31, 'یازدهم_', 'ریاضی', 'هنر-یازدهم ریاضی'),
(32, 'یازدهم_', 'ریاضی', 'فارسی(2)-یازدهم ریاضی'),
(33, 'یازدهم_', 'ریاضی', 'نگارش(2)-یازدهم ریاضی'),
(34, 'یازدهم_', 'ریاضی', 'دین و زندگی(2)-یازدهم ریاضی'),
(35, 'یازدهم_', 'ریاضی', 'عربی، زبان قرآن(2)-یازدهم ریاضی'),
(36, 'یازدهم_', 'ریاضی', 'فیزیک(2)-یازدهم ریاضی'),
(37, 'یازدهم_', 'ریاضی', 'شیمی(2)-یازدهم ریاضی'),
(38, 'یازدهم_', 'ریاضی', 'هندسه(2)-یازدهم ریاضی'),
(39, 'یازدهم_', 'ریاضی', 'حسابان(1)-یازدهم ریاضی'),
(40, 'یازدهم_', 'ریاضی', 'آمار و احتمال-یازدهم ریاضی'),
(41, 'یازدهم_', 'ریاضی', 'آزمایشگاه علوم تجربی(2)-یازدهم ریاضی'),
(42, 'یازدهم_', 'ریاضی', 'تاریخ معاصر ایران-یازدهم ریاضی'),
(43, 'یازدهم_', 'ریاضی', 'تعلیمات ادیان الهی و اخلاق (2) ـ ویژه اقلیت های دینی-یازدهم ریاضی'),
(44, 'یازدهم_', 'ریاضی', 'انگلیسی(2)-یازدهم ریاضی'),
(45, 'یازدهم_', 'ریاضی', 'کتاب کار انگلیسی(2)-یازدهم ریاضی'),
(46, 'یازدهم_', 'ریاضی', 'زمین شناسی-یازدهم ریاضی'),
(47, 'یازدهم_', 'ریاضی', 'ضمیمه دین و زندگی (2) - ویژه اهل سنت -یازدهم ریاضی'),
(48, 'یازدهم_', 'ریاضی', 'انسان و محیط زیست-یازدهم ریاضی'),
(49, 'دوازدهم_', 'ریاضی', 'فارسی(3)-دوازدهم ریاضی'),
(50, 'دوازدهم_', 'ریاضی', 'نگارش(3)-دوازدهم ریاضی'),
(51, 'دوازدهم_', 'ریاضی', 'دین و زندگی(3)-دوازدهم ریاضی'),
(52, 'دوازدهم_', 'ریاضی', 'عربی، زبان قرآن (3)-دوازدهم ریاضی'),
(53, 'دوازدهم_', 'ریاضی', 'فیزیک(3)-دوازدهم ریاضی'),
(54, 'دوازدهم_', 'ریاضی', 'شیمی(3)-دوازدهم ریاضی'),
(55, 'دوازدهم_', 'ریاضی', 'هندسه(3)-دوازدهم ریاضی'),
(56, 'دوازدهم_', 'ریاضی', 'حسابان(2)-دوازدهم ریاضی'),
(57, 'دوازدهم_', 'ریاضی', 'ریاضیات و گسسته-دوازدهم ریاضی'),
(58, 'دوازدهم_', 'ریاضی', 'هویت اجتماعی-دوازدهم ریاضی'),
(59, 'دوازدهم_', 'ریاضی', 'تعلیمات ادیان الهی و اخلاق (3) - ویژه اقلیت های دینی-دوازدهم ریاضی'),
(60, 'دوازدهم_', 'ریاضی', 'انگلیسی(3)-دوازدهم ریاضی'),
(61, 'دوازدهم_', 'ریاضی', 'کتاب کار انگلیسی(3)-دوازدهم ریاضی'),
(62, 'دوازدهم_', 'ریاضی', 'مدیریت خانواده و سبک زندگی (دختران)-دوازدهم ریاضی'),
(63, 'دوازدهم_', 'ریاضی', 'مدیریت خانواده و سبک زندگی (پسران)-دوازدهم ریاضی'),
(64, 'دوازدهم_', 'ریاضی', 'سلامت و بهداشت-دوازدهم ریاضی'),
(65, 'دهم_', 'انسانی', 'فارسی(1)-دهم انسانی'),
(66, 'دهم_', 'انسانی', 'نگارش(1)-دهم انسانی'),
(70, 'دهم_', 'انسانی', 'علوم و فنون ادبی(1)-دهم انسانی'),
(71, 'دهم_', 'انسانی', 'دین و زندگی(1)-دهم انسانی'),
(72, 'دهم_', 'انسانی', 'عربی، زبان قرآن(1)-دهم انسانی'),
(73, 'دهم_', 'انسانی', 'ریاضی و آمار(1)-دهم انسانی'),
(74, 'دهم_', 'انسانی', 'آمادگی دفاعی(1)-دهم انسانی'),
(75, 'دهم_', 'انسانی', 'جغرافیای ایران-دهم انسانی'),
(76, 'دهم_', 'انسانی', 'تاریخ 1 (ایران و جهان باستان)-دهم انسانی'),
(77, 'دهم_', 'انسانی', 'جامعه شناسی (1)-دهم انسانی'),
(78, 'دهم_', 'انسانی', 'اقتصاد-دهم انسانی'),
(79, 'دهم_', 'انسانی', 'هنر-دهم انسانی'),
(80, 'دهم_', 'انسانی', 'منطق-دهم انسانی'),
(81, 'دهم_', 'انسانی', 'کارگاه کارآفرینی و تولید-دهم انسانی'),
(82, 'دهم_', 'انسانی', 'تفکر و سواد رسانه ای-دهم انسانی'),
(83, 'دهم_', 'انسانی', 'تعلیمات ادیان الهی و اخلاق (1) ـ ویژه اقلیت های دینی-دهم انسانی'),
(84, 'دهم_', 'انسانی', 'انگلیسی (1)-دهم انسانی'),
(85, 'دهم_', 'انسانی', 'کتاب کار انگلیسی (1)-دهم انسانی'),
(86, 'یازدهم_', 'انسانی', 'هنر-یازدهم انسانی'),
(87, 'یازدهم_', 'انسانی', 'فارسی (2)-یازدهم انسانی'),
(88, 'یازدهم_', 'انسانی', 'نگارش (2) -یازدهم انسانی'),
(89, 'یازدهم_', 'انسانی', 'علوم و فنون ادبی (2) -یازدهم انسانی'),
(90, 'یازدهم_', 'انسانی', 'دین و زندگی (2)-یازدهم انسانی'),
(91, 'یازدهم_', 'انسانی', 'عربی، زبان قرآن (2)-یازدهم انسانی'),
(92, 'یازدهم_', 'انسانی', 'ریاضی و آمار (2)-یازدهم انسانی'),
(93, 'یازدهم_', 'انسانی', 'جغرافیای (2) ـ جغرافیای ناحیه ای-یازدهم انسانی'),
(94, 'یازدهم_', 'انسانی', 'تاریخ (2)-یازدهم انسانی'),
(95, 'یازدهم_', 'انسانی', 'جامعه شناسی (2)-یازدهم انسانی'),
(96, 'یازدهم_', 'انسانی', 'روان شناسی-یازدهم انسانی'),
(97, 'یازدهم_', 'انسانی', 'فلسفه (1)-یازدهم انسانی'),
(98, 'یازدهم_', 'انسانی', 'تعلیمات ادیان الهی و اخلاق (2) ـ ویژه اقلیت های دینی-یازدهم انسانی'),
(99, 'یازدهم_', 'انسانی', 'انگلیسی (2)-یازدهم انسانی'),
(100, 'یازدهم_', 'انسانی', 'کتاب کار انگلیسی (2)-یازدهم انسانی'),
(101, 'یازدهم_', 'انسانی', 'ضمیمه دین و زندگی (2) - ویژه اهل سنت-یازدهم انسانی'),
(102, 'یازدهم_', 'انسانی', 'انسان و محیط زیست-یازدهم انسانی'),
(103, 'دوازدهم_', 'انسانی', 'فارسی (3)-دوازدهم انسانی'),
(104, 'دوازدهم_', 'انسانی', 'نگارش (3)-دوازدهم انسانی'),
(105, 'دوازدهم_', 'انسانی', 'دین و زندگی (3)-دوازدهم انسانی'),
(106, 'دوازدهم_', 'انسانی', 'عربی، زبان قرآن (3)-دوازدهم انسانی'),
(107, 'دوازدهم_', 'انسانی', 'ریاضی و آمار (3)-دوازدهم انسانی'),
(108, 'دوازدهم_', 'انسانی', 'جغرافیا (3) (کاربردی)-دوازدهم انسانی'),
(109, 'دوازدهم_', 'انسانی', 'تاریخ (3) - ایران و جهان معاصر-دوازدهم انسانی'),
(110, 'دوازدهم_', 'انسانی', 'جامعه شناسی (3)-دوازدهم انسانی'),
(111, 'دوازدهم_', 'انسانی', 'تحلیل فرهنگی-دوازدهم انسانی'),
(112, 'دوازدهم_', 'انسانی', 'فلسفه (2)-دوازدهم انسانی'),
(113, 'دوازدهم_', 'انسانی', 'تعلیمات ادیان الهی و اخلاق (3) - ویژه اقلیت های دینی-دوازدهم انسانی'),
(114, 'دوازدهم_', 'انسانی', 'انگلیسی (3)-دوازدهم انسانی'),
(115, 'دوازدهم_', 'انسانی', 'کتاب کار انگلیسی (3)-دوازدهم انسانی'),
(116, 'دوازدهم_', 'انسانی', 'مدیریت خانواده و سبک زندگی (دختران)-دوازدهم انسانی'),
(117, 'دوازدهم_', 'انسانی', 'مدیریت خانواده و سبک زندگی (پسران)-دوازدهم انسانی'),
(118, 'دوازدهم_', 'انسانی', 'سلامت و بهداشت-دوازدهم انسانی'),
(119, 'دهم_', 'تجربی', 'فارسی (1)-دهم تجربی'),
(120, 'دهم_', 'تجربی', 'نگارش (1)-دهم تجربی'),
(121, 'دهم_', 'تجربی', 'دین و زندگی (1)-دهم تجربی'),
(122, 'دهم_', 'تجربی', 'عربی، زبان قرآن (1)-دهم تجربی'),
(123, 'دهم_', 'تجربی', 'شیمی (1)-دهم تجربی'),
(124, 'دهم_', 'تجربی', 'ریاضی (1)-دهم تجربی'),
(125, 'دهم_', 'تجربی', 'فیزیک (1)-دهم تجربی'),
(126, 'دهم_', 'تجربی', 'آمادگی دفاعی-دهم تجربی'),
(127, 'دهم_', 'تجربی', 'زیست شناسی (1)-دهم تجربی'),
(128, 'دهم_', 'تجربی', 'آزمایشگاه علوم تجربی (1)-دهم تجربی'),
(129, 'دهم_', 'تجربی', 'جغرافیای ایران-دهم تجربی'),
(130, 'دهم_', 'تجربی', 'هنر-دهم تجربی'),
(131, 'دهم_', 'تجربی', 'کارگاه کارآفرینی و تولید-دهم تجربی'),
(132, 'دهم_', 'تجربی', 'تفکر و سواد رسانه ای-دهم تجربی'),
(133, 'دهم_', 'تجربی', 'تعلیمات ادیان الهی و اخلاق (1) ـ ویژه اقلیت های دینی-دهم تجربی'),
(134, 'دهم_', 'تجربی', 'انگلیسی (1)-دهم تجربی'),
(135, 'دهم_', 'تجربی', 'کتاب کار انگلیسی (1)-دهم تجربی'),
(136, 'یازدهم_', 'تجربی', 'هنر-یازدهم تجربی'),
(137, 'یازدهم_', 'تجربی', 'فارسی (2)-یازدهم تجربی'),
(138, 'یازدهم_', 'تجربی', 'نگارش (2)-یازدهم تجربی'),
(139, 'یازدهم_', 'تجربی', 'دین و زندگی (2)-یازدهم تجربی'),
(140, 'یازدهم_', 'تجربی', 'عربی، زبان قرآن (2)-یازدهم تجربی'),
(141, 'یازدهم_', 'تجربی', 'شیمی (2)-یازدهم تجربی'),
(142, 'یازدهم_', 'تجربی', 'ریاضی (2)-یازدهم تجربی'),
(143, 'یازدهم_', 'تجربی', 'زیست شناسی (2)-یازدهم تجربی'),
(144, 'یازدهم_', 'تجربی', 'آزمایشگاه علوم تجربی (2)-یازدهم تجربی'),
(145, 'یازدهم_', 'تجربی', 'تاریخ معاصر ایران-یازدهم تجربی'),
(146, 'یازدهم_', 'تجربی', 'تعلیمات ادیان الهی و اخلاق (2) ـ ویژه اقلیت های دینی-یازدهم تجربی'),
(147, 'یازدهم_', 'تجربی', 'انگلیسی (2)-یازدهم تجربی'),
(148, 'یازدهم_', 'تجربی', 'ضمیمه دین و زندگی (2) - ویژه اهل سنت-یازدهم تجربی'),
(149, 'یازدهم_', 'تجربی', 'زمین شناسی-یازدهم تجربی'),
(150, 'یازدهم_', 'تجربی', 'فیزیک (2)-یازدهم تجربی'),
(151, 'یازدهم_', 'تجربی', 'انسان و محیط زیست-یازدهم تجربی'),
(152, 'دوازدهم_', 'تجربی', 'فارسی (3)-دوازدهم تجربی'),
(153, 'دوازدهم_', 'تجربی', 'نگارش (3)-دوازدهم تجربی'),
(154, 'دوازدهم_', 'تجربی', 'دین و زندگی (3)-دوازدهم تجربی'),
(155, 'دوازدهم_', 'تجربی', 'عربی، زبان قرآن (3)-دوازدهم تجربی'),
(156, 'دوازدهم_', 'تجربی', 'عربی، زبان قرآن (3)-دوازدهم تجربی'),
(157, 'دوازدهم_', 'تجربی', 'شیمی (3)-دوازدهم تجربی'),
(158, 'دوازدهم_', 'تجربی', 'ریاضی (3)-دوازدهم تجربی'),
(159, 'دوازدهم_', 'تجربی', 'زیست شناسی (3)-دوازدهم تجربی'),
(160, 'دوازدهم_', 'تجربی', 'هویت اجتماعی-دوازدهم تجربی'),
(161, 'دوازدهم_', 'تجربی', 'تعلیمات ادیان الهی و اخلاق (3) - ویژه اقلیت های دینی-دوازدهم تجربی'),
(162, 'دوازدهم_', 'تجربی', 'انگلیسی (3)-دوازدهم تجربی'),
(163, 'دوازدهم_', 'تجربی', 'کتاب کار انگلیسی (3)-دوازدهم تجربی'),
(164, 'دوازدهم_', 'تجربی', 'مدیریت خانواده و سبک زندگی (دختران)-دوازدهم تجربی'),
(165, 'دوازدهم_', 'تجربی', 'مدیریت خانواده و سبک زندگی (پسران)-دوازدهم تجربی'),
(166, 'دوازدهم_', 'تجربی', 'فیزیک (3)-دوازدهم تجربی'),
(167, 'دوازدهم_', 'تجربی', 'سلامت و بهداشت-دوازدهم تجربی');";
?>